server/app/controllers/books_controller.rb

SELECT "books".* FROM "books"
---
     def index
       all_books = Book.all

INSERT INTO "books" ("title", "author", "description", "cover_image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
INSERT INTO "book_genres" ("book_id", "genre_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["book_id", 8], ["genre_id", 2], ["created_at", "2023-04-01 03:42:24.168705"], ["updated_at", "2023-04-01 03:42:24.168705"]]
---
     def create
       new_book = Book.create!(book_params)
      genres = params[:genre_id]
      genres.each do |genre|
        new_book.book_genres.create({genre_id: genre})

UPDATE "books" SET "description" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["description", "Jay Gatsby is the man who has everything. But one thing will always be out of his reach....."], ["updated_at", "2023-04-02 12:47:00.882147"], ["id", 4]]
---
     def update
       book.update!(book_params)

DELETE FROM "books" WHERE "books"."id" = ?  [["id", 9]]
---
     def destroy
       book.destroy

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
       def book
         book = Book.find(params[:id])