server/app/controllers/reviews_controller.rb

    def create
        review = user.reviews.create!(reviews_params)
---
INSERT INTO "reviews" ("title", "content", "user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

    def show
        review = user.reviews.find_by(id: params[:id])
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" = ? AND "reviews"."id" = ? LIMIT ?  [["user_id", 3], ["id", nil], ["LIMIT", 1]]

    def index
        book = Book.find(params[:book_id])
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]

    def update
        review = user.reviews.find_by(id: params[:id])
        if review
            review.update!(reviews_params)
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" = ? AND "reviews"."id" = ? LIMIT ?  [["user_id", 3], ["id", 1], ["LIMIT", 1]]
UPDATE "reviews" SET "content" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["content", "Nice read. I like the lore and the touching story."], ["updated_at", "2023-03-28 18:46:52.551373"], ["id", 1]]

    def destroy
        review = user.reviews.find_by(id: params[:id])
        if review
            review.destroy
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" = ? AND "reviews"."id" = ? LIMIT ?  [["user_id", 3], ["id", 3], ["LIMIT", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 3]]